app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT "links".* FROM "links"

  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("summary", "url", "votes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]